duxinglang-1/nRF9160_test/AURI_T2_NCS2.3.0_TEST/src/nb/nb.c
/*
 * Copyright (c) 2018 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: LicenseRef-BSD-5-Clause-Nordic
 */
#include <stdio.h>
#include <string.h>
#include <zephyr/kernel.h>
#include <zephyr/drivers/uart.h>
#include <zephyr/net/mqtt.h>
#include <zephyr/net/socket.h>
#include <zephyr/random/rand32.h>
#include <modem/lte_lc.h>
#include <modem/at_cmd_parser.h>
#include <modem/at_params.h>
#include <modem/lte_lc.h>
#include <modem/lte_lc_trace.h>
#include <modem/modem_info.h>
#include <modem/nrf_modem_lib.h>
#include <modem/at_monitor.h>
#include <nrf_modem_at.h>
#include "lcd.h"
#include "font.h"
#include "settings.h"
#include "datetime.h"
#include "nb.h"
#include "screen.h"
#include "sos.h"
#include "gps.h"
#include "uart_ble.h"
#ifdef CONFIG_IMU_SUPPORT
#include "lsm6dso.h"
#include "fall.h"
#endif
#include "transfer_cache.h"
#ifdef CONFIG_SYNC_SUPPORT
#include "sync.h"
#endif
#include "logger.h"

//#define NB_DEBUG

#define MQTT_CONNECTED_KEEP_TIME	(30)

static void SendDataCallBack(struct k_timer *timer_id);
K_TIMER_DEFINE(send_data_timer, SendDataCallBack, NULL);
static void ParseDataCallBack(struct k_timer *timer_id);
K_TIMER_DEFINE(parse_data_timer, ParseDataCallBack, NULL);
static void MqttConnectCallBack(struct k_timer *timer_id);
K_TIMER_DEFINE(mqtt_connect_timer, MqttConnectCallBack, NULL);
static void MqttDisConnectCallBack(struct k_timer *timer_id);
K_TIMER_DEFINE(mqtt_disconnect_timer, MqttDisConnectCallBack, NULL);
static void GetNetWorkTimeCallBack(struct k_timer *timer_id);
K_TIMER_DEFINE(get_nw_time_timer, GetNetWorkTimeCallBack, NULL);
static void GetNetWorkSignalCallBack(struct k_timer *timer_id);
K_TIMER_DEFINE(get_nw_rsrp_timer, GetNetWorkSignalCallBack, NULL);
static void GetModemInforCallBack(struct k_timer *timer_id);
K_TIMER_DEFINE(get_modem_infor_timer, GetModemInforCallBack, NULL);
static void GetModemStatusCallBack(struct k_timer *timer_id);
K_TIMER_DEFINE(get_modem_status_timer, GetModemStatusCallBack, NULL);
static void NBReconnectCallBack(struct k_timer *timer_id);
K_TIMER_DEFINE(nb_reconnect_timer, NBReconnectCallBack, NULL);
static void MqttReconnectCallBack(struct k_timer *timer_id);
K_TIMER_DEFINE(mqtt_reconnect_timer, MqttReconnectCallBack, NULL);
static void MqttActWaitCallBack(struct k_timer *timer_id);
K_TIMER_DEFINE(mqtt_act_wait_timer, MqttActWaitCallBack, NULL);
static void MqttSendMissDataCallBack(struct k_timer *timer_id);
K_TIMER_DEFINE(mqtt_send_miss_timer, MqttSendMissDataCallBack, NULL);

static struct k_work_q *app_work_q;
static struct k_work_delayable modem_init_work;
static struct k_work_delayable modem_off_work;
static struct k_work_delayable modem_on_work;
static struct k_work_delayable nb_link_work;
static struct k_work_delayable nb_test_work;
static struct k_work_delayable mqtt_link_work;

NB_SIGNL_LEVEL g_nb_sig = NB_SIG_LEVEL_NO;

static struct modem_param_info modem_param;

static bool nb_redraw_sig_flag = false;
static bool send_data_flag = false;
static bool parse_data_flag = false;
static bool nb_connect_ok_flag = true;
static bool power_on_data_flag = true;
static bool nb_connecting_flag = false;
static bool nb_reconnect_flag = false;
static bool mqtt_connecting_flag = false;
static bool mqtt_connect_timeout_flag = false;
static bool mqtt_disconnect_flag = false;
static bool mqtt_reconnect_flag = false;
static bool mqtt_act_wait_timeout_flag = false;
static bool mqtt_send_miss_data_flag = false;
static bool get_modem_status_flag = false;
static bool server_has_timed_flag = false;
static bool testNB_RX_Powert_flag = false;

static CacheInfo nb_send_cache = {0};
static CacheInfo nb_rece_cache = {0};

#if defined(CONFIG_MQTT_LIB_TLS)
static sec_tag_t sec_tag_list[] = { CONFIG_SEC_TAG };
#endif/*CONFIG_MQTT_LIB_TLS*/ 

/* Buffers for MQTT client. */
static uint8_t rx_buffer[CONFIG_MQTT_MESSAGE_BUFFER_SIZE];
static uint8_t tx_buffer[CONFIG_MQTT_MESSAGE_BUFFER_SIZE];
static uint8_t payload_buf[CONFIG_MQTT_PAYLOAD_BUFFER_SIZE];

/* The mqtt client struct */
static struct mqtt_client client;

/* MQTT Broker details. */
static uint8_t broker_hostname[128] = CONFIG_MQTT_DOMESTIC_BROKER_HOSTNAME;
static uint32_t broker_port = CONFIG_MQTT_DOMESTIC_BROKER_PORT;
static struct sockaddr_storage broker;

/* Connected flag */
static bool nb_connected = false;
static bool mqtt_connected = false;

/* Net Reconnect count*/
static uint32_t net_retry_count = 0;

/* File descriptor */
static struct pollfd fds;

bool test_nb_on = false;
bool nb_is_running = false;
bool get_modem_info_flag = false;
bool get_modem_time_flag = false;
bool get_modem_signal_flag = false;
bool get_modem_cclk_flag = false;
bool test_nb_flag = false;
bool nb_test_update_flag = false;
bool g_nw_registered = false;

uint8_t g_imsi[IMSI_MAX_LEN+1] = {0};
uint8_t g_imei[IMEI_MAX_LEN+1] = {0};
uint8_t g_iccid[ICCID_MAX_LEN+1] = {0};
uint8_t g_modem[MODEM_MAX_LEN+1] = {0};

uint8_t g_prj_dir[128] = {0};
uint8_t g_new_fw_ver[64] = {0};
uint8_t g_new_modem_ver[64] = {0};
uint8_t g_new_ble_ver[64] = {0};
uint8_t g_new_wifi_ver[64] = {0};
uint8_t g_new_ui_ver[16] = {0};
uint8_t g_new_font_ver[16] = {0};
uint8_t g_new_ppg_ver[16] = {0};
uint8_t g_timezone[5] = {0};

uint8_t g_rsrp = 0;
uint16_t g_tau_time = 0;
uint16_t g_act_time = 0;
uint32_t g_tau_ext_time = 0;

uint8_t nb_test_info[256] = {0};


static NB_APN_PARAMENT nb_apn_table[] = 
{
	//china mobile
	{	
		"46004",
		"cmnbiot2"
	},
	//china unicom
	{
		"46006",
		"unim2m.njm2mapn"
	},
	//china telcom
	{
		"46011",
		"ctnb"
	},	
	//arkessa
	{
		"90128", 
		"arkessalp.com",
	},
	//1NCE
	{
		"90140",
		"iot.1nce.net",	
	},
	//Rakuten
	{
		"44011",
		"iot.biz.rakuten.jp",
	},
	//super
	{
		"47475",
		"super",
	},
};

static void NbSendDataStart(void);
static void NbSendDataStop(void);
static void MqttReceData(uint8_t *data, uint32_t datalen);
static void MqttDicConnectStart(void);
static void MqttDicConnectStop(void);

//AT_MONITOR(at_cereg_info_mon, "CEREG", at_handler, PAUSED);
//AT_MONITOR(ltelc_atmon_cereg_info, "+CEREG", at_handler_cereg, PAUSED);
AT_MONITOR(ltelc_atmon_modem_info, "%XMODEMSLEEP", at_handler_modem_notify, PAUSED);

static void at_handler_modem_notify(const char *response)
{
	int err;
	struct lte_lc_evt evt = {0};

	__ASSERT_NO_MSG(response != NULL);

