duxinglang-1/nRF9160_test/AURI_T2_NCS2.3.0_TEST/src/nb/nb.c
#ifdef NB_DEBUG
	LOGD("%%XMODEMSLEEP notification");
#endif

	err = parse_xmodemsleep(response, &evt.modem_sleep);
	if(err)
	{
	#ifdef NB_DEBUG
		LOGD("Can't parse modem sleep pre-warning notification, error: %d", err);
	#endif
		return;
	}

	/* Link controller only supports PSM, RF inactivity and flight mode
	 * modem sleep types.
	 */
	if((evt.modem_sleep.type != LTE_LC_MODEM_SLEEP_PSM) &&
		(evt.modem_sleep.type != LTE_LC_MODEM_SLEEP_RF_INACTIVITY) &&
		(evt.modem_sleep.type != LTE_LC_MODEM_SLEEP_FLIGHT_MODE))
	{
		return;
	}

	/* Propagate the appropriate event depending on the parsed time parameter. */
	if(evt.modem_sleep.time == CONFIG_LTE_LC_MODEM_SLEEP_PRE_WARNING_TIME_MS)
	{
		evt.type = LTE_LC_EVT_MODEM_SLEEP_EXIT_PRE_WARNING;
	}
	else if(evt.modem_sleep.time == 0)
	{
		LTE_LC_TRACE(LTE_LC_TRACE_MODEM_SLEEP_EXIT);
		evt.type = LTE_LC_EVT_MODEM_SLEEP_EXIT;
	}
	else
	{
		LTE_LC_TRACE(LTE_LC_TRACE_MODEM_SLEEP_ENTER);
		evt.type = LTE_LC_EVT_MODEM_SLEEP_ENTER;
	}

	event_handler_list_dispatch(&evt);
}

/**@brief Function to publish data on the configured topic
 */
static int data_publish(struct mqtt_client *c, enum mqtt_qos qos,
	uint8_t *data, size_t len)
{
	struct mqtt_publish_param param;

	param.message.topic.qos = qos;
	param.message.topic.topic.utf8 = CONFIG_MQTT_PUB_TOPIC;
	param.message.topic.topic.size = strlen(CONFIG_MQTT_PUB_TOPIC);
	param.message.payload.data = data;
	param.message.payload.len = len;
	param.message_id = sys_rand32_get();
	param.dup_flag = 0;
	param.retain_flag = 0;

	return mqtt_publish(c, &param);
}

static char *get_mqtt_topic(void)
{
	static char str_sub_topic[256] = {0};

	sprintf(str_sub_topic, "%s%s", CONFIG_MQTT_SUB_TOPIC, g_imei);
	return str_sub_topic;
}

/**@brief Function to subscribe to the configured topic
 */
static int subscribe(void)
{
	struct mqtt_topic subscribe_topic = {
		.topic = {
			.utf8 = (uint8_t *)get_mqtt_topic(),
			.size = strlen(subscribe_topic.topic.utf8)
		},
		.qos = MQTT_QOS_1_AT_LEAST_ONCE
	};

	const struct mqtt_subscription_list subscription_list = {
		.list = &subscribe_topic,
		.list_count = 1,
		.message_id = 0001
	};
#ifdef NB_DEBUG
	LOGD("Subscribing to:%s, len:%d", subscribe_topic.topic.utf8,
		subscribe_topic.topic.size);
#endif
	return mqtt_subscribe(&client, &subscription_list);
}

/**@brief Function to read the published payload.
 */
static int publish_get_payload(struct mqtt_client *c, size_t length)
{
	uint8_t *buf = payload_buf;
	uint8_t *end = buf + length;

	if(length > sizeof(payload_buf))
	{
		return -EMSGSIZE;
	}

	while(buf < end)
	{
		int ret = mqtt_read_publish_payload(c, buf, end - buf);

		if(ret < 0)
		{
			int err;

			if(ret != -EAGAIN)
			{
				return ret;
			}
		#ifdef NB_DEBUG	
			LOGD("mqtt_read_publish_payload: EAGAIN");
		#endif
			err = poll(&fds, 1,
				   CONFIG_MQTT_KEEPALIVE * MSEC_PER_SEC);
			if(err > 0 && (fds.revents & POLLIN) == POLLIN)
			{
				continue;
			}
			else
			{
				return -EIO;
			}
		}

		if(ret == 0)
		{
			return -EIO;
		}

		buf += ret;
	}

	return 0;
}

/**@brief MQTT client event handler
 */
static void mqtt_evt_handler(struct mqtt_client *const c,
		      const struct mqtt_evt *evt)
{
	int err;

	switch(evt->type)
	{
	case MQTT_EVT_CONNACK:
		if(evt->result != 0)
		{
		#ifdef NB_DEBUG
			LOGD("MQTT connect failed %d", evt->result);
		#endif
			break;
		}

		mqtt_connected = true;
		mqtt_connecting_flag = false;
		k_timer_stop(&mqtt_connect_timer);

	#ifdef NB_DEBUG
		LOGD("MQTT client connected!");		
	#endif
		subscribe();

		if(power_on_data_flag)
		{
			SendPowerOnData();
			SendSettingsData();
			power_on_data_flag = false;
		}

		NbSendDataStart();
		MqttDicConnectStart();
		break;

	case MQTT_EVT_DISCONNECT:
	#ifdef NB_DEBUG
		LOGD("MQTT client disconnected %d", evt->result);
	#endif
		mqtt_connected = false;
		
		NbSendDataStop();
		MqttDicConnectStop();
		break;

	case MQTT_EVT_PUBLISH: 
		{
			const struct mqtt_publish_param *p = &evt->param.publish;
		#ifdef NB_DEBUG
			LOGD("MQTT PUBLISH result=%d len=%d", evt->result, p->message.payload.len);
		#endif
			err = publish_get_payload(c, p->message.payload.len);
			if(err >= 0)
			{
				MqttReceData(payload_buf, p->message.payload.len);
			}
			else
			{
			#ifdef NB_DEBUG
				LOGD("mqtt_read_publish_payload: Failed! %d", err);
				LOGD("Disconnecting MQTT client...");
			#endif	
				err = mqtt_disconnect(c);
				if(err)
				{
				#ifdef NB_DEBUG
					LOGD("Could not disconnect: %d", err);
				#endif
				}

				err = mqtt_live(c);
				if(err != 0)
				{
				#ifdef NB_DEBUG
					LOGD("ERROR: mqtt_live %d", err);
				#endif
				}
			}
		} 
		break;

	case MQTT_EVT_PUBACK:
		if(evt->result != 0)
		{
		#ifdef NB_DEBUG
			LOGD("MQTT PUBACK error %d", evt->result);
		#endif
			break;
		}
	#ifdef NB_DEBUG	
		LOGD("PUBACK packet id: %u", evt->param.puback.message_id);
	#endif
		
		k_timer_stop(&mqtt_act_wait_timer);
		delete_data_from_cache(&nb_send_cache);
		k_timer_start(&send_data_timer, K_MSEC(500), K_NO_WAIT);

	#ifdef CONFIG_SYNC_SUPPORT
		SyncNetWorkCallBack(SYNC_STATUS_SENT);
	#endif	
		break;

	case MQTT_EVT_SUBACK:
		if(evt->result != 0)
		{
		#ifdef NB_DEBUG
			LOGD("MQTT SUBACK error %d", evt->result);
		#endif
			break;
		}
	#ifdef NB_DEBUG
		LOGD("SUBACK packet id: %u", evt->param.suback.message_id);
	#endif
		break;

	default:
	#ifdef NB_DEBUG
		LOGD("default: %d", evt->type);
	#endif
		break;
	}
}

/**@brief Resolves the configured hostname and
 * initializes the MQTT broker structure
 */
static void broker_init(void)
{
	int err;
	struct addrinfo *result;
	struct addrinfo *addr;
	struct addrinfo hints = {
		.ai_family = AF_INET,
		.ai_socktype = SOCK_STREAM
	};

	err = getaddrinfo(broker_hostname, NULL, &hints, &result);
	if(err)
	{
	#ifdef NB_DEBUG
		LOGD("ERROR: getaddrinfo failed %d", err);
	#endif
		return;
	}

	addr = result;
	err = -ENOENT;

	/* Look for address of the broker. */
	while(addr != NULL)
	{
		/* IPv4 Address. */
		if (addr->ai_addrlen == sizeof(struct sockaddr_in))
		{
			struct sockaddr_in *broker4 =
				((struct sockaddr_in *)&broker);
			char ipv4_addr[NET_IPV4_ADDR_LEN];

			broker4->sin_addr.s_addr =
				((struct sockaddr_in *)addr->ai_addr)
				->sin_addr.s_addr;
			broker4->sin_family = AF_INET;
			broker4->sin_port = htons(broker_port);

			inet_ntop(AF_INET, &broker4->sin_addr.s_addr,
				  ipv4_addr, sizeof(ipv4_addr));
		#ifdef NB_DEBUG
			LOGD("IPv4 Address found %s", ipv4_addr);
		#endif
			break;
		}
		else
		{
		#ifdef NB_DEBUG
			LOGD("ai_addrlen = %u should be %u or %u",
				(unsigned int)addr->ai_addrlen,
				(unsigned int)sizeof(struct sockaddr_in),
				(unsigned int)sizeof(struct sockaddr_in6));
		#endif
		}

		addr = addr->ai_next;
		break;
	}

	/* Free the address. */
	freeaddrinfo(result);
}

