duxinglang-1/nRF9160_test/AURI_T2_NCS2.3.0_TEST/src/nb/nb.c
/**@brief Initialize the MQTT client structure
 */
static void client_init(struct mqtt_client *client)
{
	static struct mqtt_utf8 password;
	static struct mqtt_utf8 username;

	mqtt_client_init(client);

	broker_init();

	/* MQTT client configuration */
	client->broker = &broker;
	
	client->evt_cb = mqtt_evt_handler;
	
	client->client_id.utf8 = (uint8_t *)g_imei;	//xb add 2021-03-24 CONFIG_MQTT_CLIENT_ID;
	client->client_id.size = strlen(g_imei);

	password.utf8 = (uint8_t *)CONFIG_MQTT_PASSWORD;
	password.size = strlen(CONFIG_MQTT_PASSWORD);
	client->password = &password;

	username.utf8 = (uint8_t *)CONFIG_MQTT_USER_NAME;
	username.size = strlen(CONFIG_MQTT_USER_NAME);
	client->user_name = &username;
	
	client->protocol_version = MQTT_VERSION_3_1_1;

	/* MQTT buffers configuration */
	client->rx_buf = rx_buffer;
	client->rx_buf_size = sizeof(rx_buffer);
	client->tx_buf = tx_buffer;
	client->tx_buf_size = sizeof(tx_buffer);

#if defined(CONFIG_MQTT_LIB_TLS)
    struct mqtt_sec_config *tls_config = &client->transport.tls.config;
    
    client->transport.type = MQTT_TRANSPORT_SECURE;
    
    tls_config->peer_verify = CONFIG_PEER_VERIFY;
    tls_config->cipher_count = 0;
    tls_config->cipher_list = NULL;
    tls_config->sec_tag_count = ARRAY_SIZE(sec_tag_list);
    tls_config->sec_tag_list = sec_tag_list;
    tls_config->hostname = broker_hostname;
#else
    client->transport.type = MQTT_TRANSPORT_NON_SECURE;
#endif/* defined(CONFIG_MQTT_LIB_TLS) */
}

/**@brief Initialize the file descriptor structure used by poll.
 */
static int fds_init(struct mqtt_client *c)
{
	if(c->transport.type == MQTT_TRANSPORT_NON_SECURE)
	{
		fds.fd = c->transport.tcp.sock;
	}
	else
	{
	#if defined(CONFIG_MQTT_LIB_TLS)
		fds.fd = c->transport.tls.sock;
	#else
		return -ENOTSUP;
	#endif
	}

	fds.events = POLLIN;

	return 0;
}

void mqtt_is_connecting(void)
{
	return mqtt_connecting_flag;
}

static void mqtt_link(struct k_work_q *work_q)
{
	int err;

#ifdef NB_DEBUG
	LOGD("begin");
#endif

#ifdef CONFIG_FACTORY_TEST_SUPPORT
	if(FactryTestActived())
		return;
#endif

	mqtt_connecting_flag = true;
	
	client_init(&client);

	err = mqtt_connect(&client);
	if(err != 0)
	{
	#ifdef NB_DEBUG
		LOGD("ERROR: mqtt_connect %d", err);
	#endif
		goto link_over;
	}

	err = fds_init(&client);
	if(err != 0)
	{
	#ifdef NB_DEBUG
		LOGD("ERROR: fds_init %d", err);
	#endif
		goto link_over;
	}

	while(1)
	{
		err = poll(&fds, 1, mqtt_keepalive_time_left(&client));
		if(err < 0)
		{
		#ifdef NB_DEBUG
			LOGD("ERROR: poll %d", errno);
		#endif
			break;
		}

		err = mqtt_live(&client);
		if((err != 0) && (err != -EAGAIN))
		{
		#ifdef NB_DEBUG
			LOGD("ERROR: mqtt_live %d", err);
		#endif
			break;
		}

		if((fds.revents & POLLIN) == POLLIN)
		{
			err = mqtt_input(&client);
			if(err != 0)
			{
			#ifdef NB_DEBUG
				LOGD("ERROR: mqtt_input %d", err);
			#endif
				break;
			}
		}

		if((fds.revents & POLLERR) == POLLERR)
		{
		#ifdef NB_DEBUG
			LOGD("POLLERR");
		#endif
			break;
		}

		if((fds.revents & POLLNVAL) == POLLNVAL)
		{
		#ifdef NB_DEBUG
			LOGD("POLLNVAL");
		#endif
			break;
		}
	}
#ifdef NB_DEBUG	
	LOGD("Disconnecting MQTT client...");
#endif

	err = mqtt_disconnect(&client);
	if(err)
	{
	#ifdef NB_DEBUG
		LOGD("Could not disconnect MQTT client. Error: %d", err);
	#endif
	}

	err = mqtt_live(&client);
	if(err != 0)
	{
	#ifdef NB_DEBUG
		LOGD("ERROR: mqtt_live %d", err);
	#endif
	}

link_over:
	mqtt_connecting_flag = false;
}

static void SendDataCallBack(struct k_timer *timer)
{
	send_data_flag = true;
}

static void NbSendDataStart(void)
{
	k_timer_start(&send_data_timer, K_MSEC(500), K_NO_WAIT);
}

static void NbSendDataStop(void)
{
	k_timer_stop(&send_data_timer);
}

static void NbSendData(void)
{
	uint8_t data_type,*p_data;
	uint32_t data_len;
	int ret;
	
	ret = get_data_from_cache(&nb_send_cache, &p_data, &data_len, &data_type);
	if(ret)
	{
		if(k_timer_remaining_get(&mqtt_disconnect_timer) > 0)
			k_timer_stop(&mqtt_disconnect_timer);
		k_timer_start(&mqtt_disconnect_timer, K_SECONDS(MQTT_CONNECTED_KEEP_TIME), K_NO_WAIT);
		
		data_publish(&client, MQTT_QOS_1_AT_LEAST_ONCE, p_data, data_len);
		
		if(k_timer_remaining_get(&mqtt_act_wait_timer) > 0)
			k_timer_stop(&mqtt_act_wait_timer);
		k_timer_start(&mqtt_act_wait_timer, K_SECONDS(MQTT_CONNECTED_KEEP_TIME-5), K_NO_WAIT);
	}
}

bool MqttIsConnected(void)
{
#ifdef NB_DEBUG
	LOGD("mqtt_connected:%d", mqtt_connected);
#endif
	return mqtt_connected;
}

void DisConnectMqttLink(void)
{
	int err;
		
	if(k_timer_remaining_get(&mqtt_disconnect_timer) > 0)
		k_timer_stop(&mqtt_disconnect_timer);

	if(mqtt_connected)
	{
		err = mqtt_disconnect(&client);
		if(err)
		{
		#ifdef NB_DEBUG
			LOGD("Could not disconnect MQTT client. Error: %d", err);
		#endif
		}

		err = mqtt_live(&client);
		if(err != 0)
		{
		#ifdef NB_DEBUG
			LOGD("ERROR: mqtt_live %d", err);
		#endif
		}
		
		mqtt_connected = false;
	}
}

static void MqttDisConnect(void)
{
	int err;

#ifdef NB_DEBUG
	LOGD("begin");
#endif
	err = mqtt_disconnect(&client);
	if(err)
	{
	#ifdef NB_DEBUG
		LOGD("Could not disconnect MQTT client. Error: %d", err);
	#endif
	}

	err = mqtt_live(&client);
	if(err != 0)
	{
	#ifdef NB_DEBUG
		LOGD("ERROR: mqtt_live %d", err);
	#endif
	}
}

static void MqttConnectCallBack(struct k_timer *timer_id)
{
	mqtt_connect_timeout_flag = true;
}

static void MqttDisConnectCallBack(struct k_timer *timer_id)
{
#ifdef NB_DEBUG
	LOGD("begin");
#endif
	mqtt_disconnect_flag = true;
}

static void MqttDicConnectStart(void)
{
#ifdef NB_DEBUG
	LOGD("begin");
#endif
	k_timer_start(&mqtt_disconnect_timer, K_SECONDS(MQTT_CONNECTED_KEEP_TIME), K_NO_WAIT);
}

static void MqttDicConnectStop(void)
{
	k_timer_stop(&mqtt_disconnect_timer);
}


/**@brief Callback handler for LTE RSRP data. */
static void modem_rsrp_handler(char rsrp_value)
{
	/* RSRP raw values that represent actual signal strength are
	 * 0 through 97 (per "nRF91 AT Commands" v1.1). If the received value
	 * falls outside this range, we should not send the value.
	 */
#ifdef NB_DEBUG
	LOGD("rsrp_value:%d", rsrp_value);
#endif
	if(g_rsrp != rsrp_value)
	{
		if((g_rsrp == 255)&&(rsrp_value != 0))
		{
			if(!server_has_timed_flag)
				k_timer_start(&get_nw_time_timer, K_MSEC(500), K_NO_WAIT);
		}

		g_rsrp = rsrp_value;
		nb_redraw_sig_flag = true;
	}
}

#ifdef CONFIG_MODEM_INFO
/**brief Initialize LTE status containers. */
void modem_data_init(void)
{
	int err;

	err = modem_info_init();
	if(err)
	{
	#ifdef NB_DEBUG
		LOGD("Modem info could not be established: %d", err);
	#endif
		return;
	}

