duxinglang-1/nRF9160_test/AURI_T2_NCS2.3.0_TEST/src/nb/nb.c
void SetNetWorkParaByPlmn(uint8_t *imsi)
{
	//SetNetWorkApn(imsi);
	SetNwtWorkMqttBroker(imsi);
}

void GetModemInfor(void)
{
	static uint8_t count = 3;
	uint8_t tmpbuf[256] = {0};

	if(nrf_modem_at_cmd(tmpbuf, sizeof(tmpbuf), CMD_GET_MODEM_V) == 0)
	{
		strncpy(g_modem, &tmpbuf, MODEM_MAX_LEN);
	#ifdef NB_DEBUG
		LOGD("MODEM version:%s", g_modem);
	#endif	
	}

	if(nrf_modem_at_cmd(tmpbuf, sizeof(tmpbuf), CMD_GET_IMEI) == 0)
	{
		strncpy(g_imei, tmpbuf, IMEI_MAX_LEN);
	#ifdef NB_DEBUG
		LOGD("imei:%s", g_imei);
	#endif	
	}

	if(nrf_modem_at_cmd(tmpbuf, sizeof(tmpbuf), CMD_GET_IMSI) == 0)
	{
		strncpy(g_imsi, tmpbuf, IMSI_MAX_LEN);
	#ifdef NB_DEBUG
		LOGD("imsi:%s", g_imsi);
	#endif
	}

	if(nrf_modem_at_cmd(tmpbuf, sizeof(tmpbuf), CMD_GET_ICCID) == 0)
	{
		strncpy(g_iccid, &tmpbuf[9], ICCID_MAX_LEN);
	#ifdef NB_DEBUG
		LOGD("iccid:%s", g_iccid);
	#endif
	}

	if((strlen(g_imsi) == 0)
		||(strlen(g_imei) == 0)
		||(strlen(g_iccid) == 0)
		||(strlen(g_modem) == 0)
		)
	{
		if(count > 0)
		{
			count--;
			k_timer_start(&get_modem_infor_timer, K_SECONDS(2), K_NO_WAIT);
		}
	}

#if 0	//xb add 2023.07.25 外国无信号卡测试，在发射端(DK板或者另外一块手表上调用
	{
        if(nrf_modem_at_cmd(tmpbuf, sizeof(tmpbuf), "AT%%XRFTEST=1,1,20,8470,23,0,3,12,0,0,0,0,0") == 0)
        {
			LOGD("modem status:%s", tmpbuf);
		}
		else
		{
			LOGD("no_buf!");
		}
    }
#endif
}

void GetModemStatus(void)
{
	char *ptr;
	int i=0,len,err;
	uint8_t strbuf[64] = {0};
	uint8_t tmpbuf[256] = {0};

	if(nrf_modem_at_cmd(tmpbuf, sizeof(tmpbuf), CMD_GET_MODEM_PARA) == 0)
	{
	#ifdef NB_DEBUG
		LOGD("MODEM parameter:%s", &tmpbuf);
	#endif
		DecodeModemMonitor(tmpbuf, strlen(tmpbuf));
	}
}

void SetModemTurnOn(void)
{
	uint8_t buf[128] = {0};

	if(nrf_modem_at_cmd(buf, sizeof(buf), "AT+CFUN?") == 0)
	{
		uint8_t *ptr,ret,tmpbuf[10] = {0};

	#ifdef NB_DEBUG
		LOGD("modem status:%s", buf);
	#endif

		ptr = strstr(buf, "+CFUN: ");
		if(ptr)
		{
			ptr += strlen("+CFUN: ");
			memcpy(tmpbuf, ptr, 1);
			ret = atoi(tmpbuf);
			if(ret == 1)
			{
			#ifdef NB_DEBUG
				LOGD("modem has been turn on, return!");
			#endif
				return;
			}
		}
	}
	
	if(nrf_modem_at_cmd(buf, sizeof(buf), "AT+CFUN=1") == 0)
	{
	#ifdef NB_DEBUG
		LOGD("turn on modem success!");
	#endif
	}
	else
	{
	#ifdef NB_DEBUG
		LOGD("Can't turn on modem!");
	#endif
	}
}

void SetModemTurnOff(void)
{
	uint8_t buf[128] = {0};

	if(nrf_modem_at_cmd(buf, sizeof(buf), "AT+CFUN?") == 0)
	{
		uint8_t *ptr,ret,tmpbuf[10] = {0};

	#ifdef NB_DEBUG
		LOGD("modem status:%s", buf);
	#endif

		ptr = strstr(buf, "+CFUN: ");
		if(ptr)
		{
			ptr += strlen("+CFUN: ");
			memcpy(tmpbuf, ptr, 1);
			ret = atoi(tmpbuf);
			if(ret == 0)
			{
			#ifdef NB_DEBUG
				LOGD("modem has been turn off, return!");
			#endif
				return;
			}
		}
	}
	
	if(mqtt_connected)
		DisConnectMqttLink();

	nb_connected = false;
	mqtt_connected = false;

	if(nrf_modem_at_cmd(buf, sizeof(buf), "AT+CFUN=0") == 0)
	{
	#ifdef NB_DEBUG
		LOGD("turn off modem success!");
	#endif
	}
	else
	{
	#ifdef NB_DEBUG
		LOGD("Can't turn off modem!");
	#endif
	}
}

void AppSetModemOn(void)
{
	k_work_schedule_for_queue(app_work_q, &modem_on_work, K_NO_WAIT);
}

void AppSetModemOff(void)
{
	k_work_schedule_for_queue(app_work_q, &modem_off_work, K_NO_WAIT);
}

void SetModemGps(void)
{
	uint8_t buf[128] = {0};

	if(nrf_modem_at_cmd(buf, sizeof(buf), CMD_SET_NW_MODE_GPS) == 0)
	{
	#ifdef NB_DEBUG
		LOGD("set modem for gps success!");
	#endif
	}
	else
	{
	#ifdef NB_DEBUG
		LOGD("set modem for gps fail!");
	#endif
	}
}

void GetModemAPN(void)
{
	uint8_t tmpbuf[128] = {0};
	
	if(nrf_modem_at_cmd(tmpbuf, sizeof(tmpbuf), CMD_GET_APN) == 0)
	{
	#ifdef NB_DEBUG
		LOGD("apn:%s", tmpbuf);	
	#endif
	}
}

void SetModemAPN(void)
{
	uint8_t tmpbuf[128] = {0};
	
	if(nrf_modem_at_cmd(tmpbuf, sizeof(tmpbuf), "AT+CGDCONT=0,\"IP\",\"arkessalp.com\"") != 0)
	{
	#ifdef NB_DEBUG
		LOGD("set apn fail!");
	#endif
	}

	if(nrf_modem_at_cmd(tmpbuf, sizeof(tmpbuf), CMD_GET_APN) != 0)
	{
	#ifdef NB_DEBUG
		LOGD("Get apn fail!");
	#endif
		return;
	}
#ifdef NB_DEBUG
	LOGD("apn:%s", tmpbuf);	
#endif
}

static void modem_link_init(struct k_work *work)
{
#ifdef CONFIG_FACTORY_TEST_SUPPORT
	if(FactryTestActived()&&!IsFTNetTesting())
		return;
#endif

	SetModemTurnOn();
	GetModemInfor();
	SetModemTurnOff();

	k_work_schedule_for_queue(app_work_q, &nb_link_work, K_NO_WAIT);
}

static void modem_on(struct k_work *work)
{
#ifdef NB_DEBUG
	LOGD("begin");
#endif

	SetModemTurnOn();
}

static void modem_off(struct k_work *work)
{
#ifdef NB_DEBUG
	LOGD("begin");
#endif

	SetModemTurnOff();
}

static void nb_test(struct k_work *work)
{
	int err;
	uint8_t buf[128] = {0};
	
	strcpy(nb_test_info, "modem_configure");
#ifdef NB_SIGNAL_TEST	
	TestNBUpdateINfor();
#endif
#ifdef CONFIG_FACTORY_TEST_SUPPORT	
	FTNetStatusUpdate(0);
#endif

#ifdef NB_DEBUG
	LOGD("LTE Link Connecting ...");
#endif

	strcpy(nb_test_info, "LTE Link Connecting ...");
#ifdef NB_SIGNAL_TEST
	TestNBUpdateINfor();
#endif
#ifdef CONFIG_FACTORY_TEST_SUPPORT	
	FTNetStatusUpdate(0);
#endif

	err = lte_lc_init_and_connect();
	__ASSERT(err == 0, "LTE link could not be established.");
#ifdef NB_DEBUG
	LOGD("LTE Link Connected!");
#endif

	strcpy(nb_test_info, "LTE Link Connected!");
#ifdef NB_SIGNAL_TEST
	TestNBUpdateINfor();
#endif
#ifdef CONFIG_FACTORY_TEST_SUPPORT	
	FTNetStatusUpdate(0);
#endif

	k_timer_start(&get_nw_rsrp_timer, K_MSEC(1000), K_NO_WAIT);
}

static void nb_link(struct k_work *work)
{
	int err=0;
	uint8_t tmpbuf[128] = {0};

#ifdef CONFIG_FACTORY_TEST_SUPPORT
	if(FactryTestActived()&&!IsFTNetTesting())
		return;
#endif

	if(gps_is_working())
	{
	#ifdef NB_DEBUG
		LOGD("gps is working, continue waiting!");
	#endif
	
		k_timer_start(&nb_reconnect_timer, K_SECONDS(30), K_NO_WAIT);
	}
	else
	{
	#ifdef NB_DEBUG
		LOGD("linking");
	#endif
		nb_connecting_flag = true;
	
