duxinglang-1/nRF9160_test/AURI_T2_NCS2.3.0_TEST/src/nb/nb.c
		if(test_nb_flag)
			configure_normal_power();
		else
			configure_low_power();

		err = lte_lc_init_and_connect();
		if(err)
		{
		#ifdef NB_DEBUG
			LOGD("Can't connected to LTE network. retry count:%d", net_retry_count);
		#endif
		
		#ifdef CONFIG_SYNC_SUPPORT
			SyncNetWorkCallBack(SYNC_STATUS_FAIL);
		#endif

			nb_connected = false;

			net_retry_count++;
			if(net_retry_count <= 2)		//2次以内每1分钟重连一次
				k_timer_start(&nb_reconnect_timer, K_SECONDS(60), K_NO_WAIT);
			else if(net_retry_count <= 4)	//3到4次每5分钟重连一次
				k_timer_start(&nb_reconnect_timer, K_SECONDS(300), K_NO_WAIT);
			else if(net_retry_count <= 6)	//5到6次每10分钟重连一次
				k_timer_start(&nb_reconnect_timer, K_SECONDS(600), K_NO_WAIT);
			else if(net_retry_count <= 8)	//7到8次每1小时重连一次
				k_timer_start(&nb_reconnect_timer, K_SECONDS(3600), K_NO_WAIT);
			else							//8次以上每6小时重连一次
				k_timer_start(&nb_reconnect_timer, K_SECONDS(6*3600), K_NO_WAIT);	
		}
		else
		{
		#ifdef NB_DEBUG
			LOGD("Connected to LTE network");
		#endif

			nb_connect_ok_flag = true;


			if(test_nb_flag)
			{
				strcpy(nb_test_info, "LTE Link Connected!");
			#ifdef NB_SIGNAL_TEST
				TestNBUpdateINfor();
			#endif
			#ifdef CONFIG_FACTORY_TEST_SUPPORT	
				FTNetStatusUpdate(0);
			#endif	
				k_timer_start(&get_nw_rsrp_timer, K_MSEC(1000), K_NO_WAIT);
			}
			
			nb_connected = true;
			net_retry_count = 0;
		#ifdef CONFIG_MODEM_INFO
			modem_data_init();
		#endif

			if(!server_has_timed_flag)
				k_timer_start(&get_nw_time_timer, K_MSEC(500), K_NO_WAIT);
			
		}

		GetModemStatus();

	#ifndef NB_SIGNAL_TEST
		if(!nb_connected)
			SetModemTurnOff();
		
		if(!err && !test_nb_flag)
		{
			SetNetWorkParaByPlmn(g_imsi);
			if(mqtt_connecting_flag)
				MqttDisConnect();

			k_work_schedule_for_queue(app_work_q, &mqtt_link_work, K_SECONDS(2));
		}
	#endif

		nb_connecting_flag = false;
	}
}

bool nb_reconnect(void)
{
	if(k_timer_remaining_get(&nb_reconnect_timer) > 0)
		k_timer_stop(&nb_reconnect_timer);
	
	nb_reconnect_flag = true;
}

bool nb_is_chinese_sim(void)
{
	bool ret = false;

	if(strncmp(g_imsi, "460", strlen("460")) == 0)
		ret = true;

	return ret;
}

bool nb_is_connecting(void)
{
#ifdef NB_DEBUG
	LOGD("nb_connecting_flag:%d", nb_connecting_flag);
#endif
	return nb_connecting_flag;
}

bool nb_is_connected(void)
{
	return nb_connected;
}

void nb_test_update(void)
{
	if(screen_id == SCREEN_ID_NB_TEST)
		scr_msg[screen_id].act = SCREEN_ACTION_UPDATE;
}

void NBMsgProcess(void)
{
	if(test_nb_on)
	{
		test_nb_on = false;
		if(nb_is_running)
			return;

		nb_is_running = true;
		test_nb_flag = true;
	#ifdef NB_DEBUG
		LOGD("Start NB-IoT test!");
	#endif
	
		if(nb_is_connecting())
		{
			strcpy(nb_test_info, "LTE Link Connecting ...");
		#ifdef NB_SIGNAL_TEST
			TestNBUpdateINfor();
		#endif
		#ifdef CONFIG_FACTORY_TEST_SUPPORT	
			FTNetStatusUpdate(0);
		#endif	
		}
		else
		{
			SetModemTurnOff();
			configure_normal_power();
			k_work_schedule_for_queue(app_work_q, &nb_test_work, K_NO_WAIT);
		}
	}

	if(get_modem_info_flag)
	{	
		GetModemInfor();
		get_modem_info_flag = false;
	}

	if(nb_redraw_sig_flag)
	{
		NBRedrawSignal();
		nb_redraw_sig_flag = false;
	}

	if(get_modem_signal_flag)
	{
		GetModemSignal();
		get_modem_signal_flag = false;

		if((screen_id == SCREEN_ID_NB_TEST)
			#ifdef CONFIG_FACTORY_TEST_SUPPORT
			|| IsFTNetTesting()
			#endif
			)
		{
			k_timer_start(&get_nw_rsrp_timer, K_MSEC(1000), K_NO_WAIT);
		}
	}

	if(get_modem_time_flag)
	{	
		GetModemDateTime();
		get_modem_time_flag = false;
	}

	if(get_modem_status_flag)
	{
		GetModemStatus();
		get_modem_status_flag = false;
	}
	
	if(send_data_flag)
	{
		NbSendData();
		send_data_flag = false;
	}

	if(parse_data_flag)
	{
		ParseReceData();
		parse_data_flag = false;
	}
	
	if(mqtt_disconnect_flag)
	{
		if(cache_is_empty(&nb_send_cache))
		{
		#ifdef NB_DEBUG
			LOGD("001");
		#endif
			MqttDisConnect();
		}
		else
		{
		#ifdef NB_DEBUG
			LOGD("002");
		#endif
			k_timer_start(&mqtt_disconnect_timer, K_SECONDS(5), K_NO_WAIT);
		}
		
		mqtt_disconnect_flag = false;
	}

	if(mqtt_send_miss_data_flag)
	{
	#if defined(CONFIG_IMU_SUPPORT)&&(defined(CONFIG_STEP_SUPPORT)||defined(CONFIG_SLEEP_SUPPORT)) 
		SendMissingSportData();
	#endif
	#if defined(CONFIG_PPG_SUPPORT)||defined(CONFIG_TEMP_SUPPORT)
		SendMissingHealthData();
	#endif
		mqtt_send_miss_data_flag = false;
	}
	
	if(nb_test_update_flag)
	{
		nb_test_update_flag = false;
		nb_test_update();
	}

	if(nb_reconnect_flag)
	{
	#ifdef NB_DEBUG
		LOGD("nb_reconnect_flag begin");
	#endif
		nb_reconnect_flag = false;
		
		if(test_gps_flag || nb_connected
		#ifdef CONFIG_FACTORY_TEST_SUPPORT
			|| FactryTestActived()
		#endif
			)
			return;

		if(!nb_connecting_flag)
		{
		#ifdef NB_DEBUG
			LOGD("nb_reconnect_flag 001");
		#endif
			k_work_schedule_for_queue(app_work_q, &nb_link_work, K_SECONDS(2));
		}
		else
		{
		#ifdef NB_DEBUG
			LOGD("nb_reconnect_flag 002");
		#endif
			k_timer_start(&nb_reconnect_timer, K_SECONDS(30), K_NO_WAIT);
		}
	}

	if(mqtt_reconnect_flag)
	{
	#ifdef NB_DEBUG
		LOGD("mqtt_reconnect_flag begin");
	#endif
		mqtt_reconnect_flag = false;

		if(test_gps_flag || mqtt_connected
		#ifdef CONFIG_FACTORY_TEST_SUPPORT
			|| FactryTestActived()
		#endif
			)
			return;

		if(!mqtt_connecting_flag)
		{
		#ifdef NB_DEBUG
			LOGD("mqtt_reconnect_flag 001");
		#endif
			k_work_schedule_for_queue(app_work_q, &mqtt_link_work, K_SECONDS(2));
		}
		else
		{
		#ifdef NB_DEBUG
			LOGD("mqtt_reconnect_flag 002");
		#endif
			k_timer_start(&mqtt_reconnect_timer, K_SECONDS(30), K_NO_WAIT);
		}		
	}

	if(mqtt_connect_timeout_flag)
	{
	#ifdef NB_DEBUG
		LOGD("mqtt_connect_timeout_flag begin");
	#endif
		MqttDisConnect();
		mqtt_connect_timeout_flag = false;
	}
	
	if(mqtt_act_wait_timeout_flag)
	{
	#ifdef NB_DEBUG
		LOGD("mqtt_act_wait_timeout_flag begin");
	#endif
		mqtt_act_wait_timeout_flag = false;

		if(test_gps_flag
		#ifdef CONFIG_FACTORY_TEST_SUPPORT
			|| FactryTestActived()
		#endif
			)
			return;

		DisConnectMqttLink();
		mqtt_connected = false;

		if(!mqtt_connecting_flag)
		{
		#ifdef NB_DEBUG
			LOGD("mqtt_act_wait_timeout_flag 001");
		#endif
			k_work_schedule_for_queue(app_work_q, &mqtt_link_work, K_SECONDS(2));
		}
		else
		{
		#ifdef NB_DEBUG
			LOGD("mqtt_act_wait_timeout_flag 002");
		#endif		
			k_timer_start(&mqtt_reconnect_timer, K_SECONDS(30), K_NO_WAIT);
		}	
	}


	if(nb_connecting_flag || mqtt_connecting_flag)
	{
		k_sleep(K_MSEC(5));
	}
}

void NB_init(struct k_work_q *work_q)
{
	int err;

	app_work_q = work_q;

	k_work_init_delayable(&modem_init_work, modem_link_init);
	k_work_init_delayable(&modem_on_work, modem_on);
	k_work_init_delayable(&modem_off_work, modem_off);
	k_work_init_delayable(&nb_link_work, nb_link);
	k_work_init_delayable(&nb_test_work, nb_test);
	k_work_init_delayable(&mqtt_link_work, mqtt_link);
#ifdef CONFIG_FOTA_DOWNLOAD
	fota_work_init(work_q);
#endif
#ifdef CONFIG_DATA_DOWNLOAD_SUPPORT
	dl_work_init(work_q);
#endif

	k_work_schedule_for_queue(app_work_q, &modem_init_work, K_NO_WAIT);
}
